---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.TrussFailures
source: html/b56f365f-a6f9-3ed1-8e1a-ebac29099530.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures

Failures about Truss.

## Syntax (C#)
```csharp
public static class TrussFailures
```